Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N11B.tmx
Source language: en_us
Languages: zh_cn

source: And that was how they first saw her.
zh_cn: 这就是他们第一眼看见她时的样子。

source: They passed Mr. Allsop in the Rover; he was turning out of the unmade-up road just as they turned into it.
zh_cn: 他们的车与艾尔索普先生的罗孚车擦肩而过，他从这条没有铺设路面的小路上转弯出去，而他们正好转弯进来。

source: Mr. Allsop noticed them, because he knew most of the cars that visited the road, and he didn't recognize or much like the look of this one: an expensive dark-green sporty two-seater convertible, with one long-haired youth in a sloppy vest lolling in each seat, and one- smoking something that might have been more sinister than a cigarette- squeezed into the little luggage space behind, craning forward, as he was bound to, between his friends.
zh_cn: 艾尔索普先生留意到他们，因为他认识大部分开到这条路上来的车辆。也许是因为他感觉这辆车陌生，或者因为他喜欢这辆车的款式：这是一辆价格昂贵的深绿色双座运动型敞篷车，有两名身穿宽松背心的长发青年懒洋洋地分坐在前排两个座椅上，另外一名挤在后排行李厢里的青年正抽着可能比香烟更有害的东西，他伸长头颈把头伸到前排的两个朋友中间。

source: The driver, who had one languid hand on the wheel, cornered carelessly in a puff of chalk dust, tires spitting loose stones.
zh_cn: 司机把一只手有气无力地搭在方向盘上，在飞扬的白灰粉尘中小心地把车开在路边上，轮胎滚在松散的石子上刷刷作响。

source: (If they were my kids, Mr. Allsop thought, catch me allowing them anywhere near my car.
zh_cn: （艾尔索普先生想，假如他们是我的孩子，我决不会让他们碰我的车。

source: It's not all bad that Robin's such a drip.)
zh_cn: 这样看来罗宾生性软弱也不全是坏事。）

source: Had the family ever realized that Jane had been abducted, her father would probably have remembered and suspected these visiting aliens.
zh_cn: 假如简的家人知道她被劫持这件事的话，她父亲也许会想起并且怀疑到这些不速之客。

source: The boys were drunk and stoned, and hadn't been to bed at all the night before (but then they hadn't got out of bed until four the previous afternoon).
zh_cn: 车上的男孩们曾经喝醉了酒还磕了药，他们前天晚上一夜未睡，然后昨天一直睡到下午四点才起床。

source: They were out looking for girls, in Nigel's father's car. (Nigel was the one squeezed into the luggage space.)
zh_cn: 他们现在开着尼格尔父亲的车出来找女孩（尼格尔就是挤在行李厢里的那一位）。

source: They'd finished their second year at Oxford and were staying at Nigel's house, about a twenty-minute drive from the Allsops', while his parents were away in France.
zh_cn: 他们刚在牛津大学读完两年级，眼下正住在尼格尔的家里，这个地方离艾尔索普先生家有二十分钟的车程，尼格尔的父母去了法国。

source: After sagging at dawn, dozing in the angular Swedish armchairs in the lounge, and filling Nigel's mother's fashionable ashtrays while listening to the Grateful Dead, all three had found a second wind, swimming several thrashing lengths in Nigel's pool.
zh_cn: 他们在黎明时分感觉精神萎靡，于是在客厅里棱角分明的瑞典沙发上打了一会盹。他们抽完的烟蒂塞满了尼格尔母亲款式新颖的烟灰缸。听着“感恩而死”乐队的摇滚乐，他们感到来了劲，就到尼格尔家的游泳池里游了一会泳。

source: The loveliness of the morning had then seemed their own fresh discovery: the light as limpid as the water, birdsong skimming the flat echoless air, the sun's touch intricate on their skin.
zh_cn: 可爱的清晨似乎成了他们的新发现：光线像水一样柔和，沉寂的空气中传来了鸟叫，阳光柔密细致地抹上了他们的皮肤。

source: They had decided that they needed to find girls to crown the day. That was a few hours ago.
zh_cn: 他们决定要去找女孩来成就这一天的高潮，这就是发生在几小时前的事情。

source: It had taken them a while to get started; and then there'd been a striking absence, everywhere they'd driven, of available girls.
zh_cn: 他们又耽搁了一会后才出发，但是无论他们把车开到哪里，都没有见到女孩的踪影。

source: "She'll do," one of them called out when they saw Jane, loud enough for her to hear.
zh_cn: “她可以啊...，”当他们看见简时其中有一个人叫了起来，声音响到足以让简听见。

source: It was Paddy (not Irish at all), the bulky, clever-looking one in the passenger seat, with small eyes like chinks of bright glass and greasy hair the color and texture of old rope, pushed behind pink ears.
zh_cn: 这是帕迪（他并非爱尔兰人），他坐在副驾座上，身材魁梧，面相聪明，小小的眼睛像是明亮玻璃上的两道裂缝，油腻的头发向后推到耳朵后面，无论是头发的颜色还是样式都像是旧麻绳。

source: He took the joint from Nigel and blinked at Jane through its smoke with a sort of appraising impartial severity, not lascivious.
zh_cn: 他从尼格尔身边露出头来，透过烟雾向简眨着眼睛，神情像是一种带有赞许的公正严格的审视，没有丝毫淫荡的意思。

source: "But where will we put these girls?"
zh_cn: “但是我们把她放在哪儿呢？”

source: Nigel asked facetiously, after one glance at Jane: he didn't fancy sharing his small space (and wasn't, in fact, much interested in girls).
zh_cn: 尼格尔瞥了简一眼，有点开玩笑似的问，他显然不想让简挤进他待的小小后排行李厢来（事实上他对女孩的兴趣也不是很大）。

source: Paddy explained that they'd have to collect them one at a time.
zh_cn: 帕迪解释说他们可以把女孩一个一个地接过来。

source: Jane stood barefoot, hands still open in that gesture of self-relinquishment.
zh_cn: 简光着脚站在那里，双手仍然摊开着做出一种自暴自弃的样子。

source: She wasn't plain in that moment, though she didn't know it.
zh_cn: 在这一刻她看上去并不难看，尽管她自己不知道这一点。

source: Something was revealed in her that was normally hidden: an auburn light in her face, her freckles startling as the camouflage of an animal, blotting up against her lips and eyelids.
zh_cn: 有些平常隐藏起来的东西现在暴露无遗了：她脸上透出一种红褐色的光采，她的雀斑多得惊人像是动物的伪装色，嘴唇和眼睑上面都是。

source: There were ginger glints, too, in her hair, which she wore in two bunches, fastened with different-colored elastic bands.
zh_cn: 她的头发是姜黄色的，她把头发梳成两个发髻，各用一根颜色不同的橡皮圈扎起来。

source: Her eyes with their pale lashes, because she was unhappy, communicated keenly.
zh_cn: 因为她正在生着气，她的眼光中流露出些许责难并急切渴望交流。

source: Her family called her pudgy, but she just looked soft, as if she were longing to nestle.
zh_cn: 她家里人叫她小胖，但是她现在看上去只是很柔弱，好像是渴望着找到一个舒适的窝。

source: Her jawline was pure, the pale lips rather full, cracked, parted.
zh_cn: 她的下颚线条很纯粹，淡红色的双唇很饱满，嘴唇正微微张开着。

source: She seemed not fake or stuck up- and, just then in the dappled light, not a child, either.
zh_cn: 她看上去并不做作或拘泥，并且在树荫摇曳的光线下看上去也不像是个孩子。

source: None of this was wasted on the boys.
zh_cn: 男孩们把这一切都看得一清二楚。

source: It didn't occur to Jane that the car would stop for her; she watched it hungrily, sifting the silky dust between her toes.
zh_cn: 简没有想到这辆车会在她面前停下来，她一边出神地张望着，一边清除着脚趾间柔软的泥土。

source: Daniel, the driver, Jane saw at once, was the best-looking of the three; in fact, he was crushingly beautiful- his features smudged and vivid at once, as if sketched in black ink- and her heart fastened on him.
zh_cn: 简立刻看出来，司机丹尼尔是三个人当中长得最好看的。事实上他可以说是帅呆了，他的外表立时变得朦胧并生动起来，好像是一幅用黑墨水画出来的素描，她的心被他迷住了。

source: When he had stopped the car, he asked her what her name was and she told him.
zh_cn: 他把车停下来后问她叫什么名字，简告诉了他。

source: "Want to come for a ride?" he said kindly.
zh_cn: “想去兜兜风吗？”他很和善地问她。

source: She hesitated only for a moment.
zh_cn: 她犹豫了片刻。

source: "Not in the back," she said, quite clear about it. Already, she didn't care for Nigel.
zh_cn: “我不坐在后排，”她说，意思明白无误，她已经对尼格尔没有兴趣了。

source: "Between us in the front," Paddy said, squeezing over.
zh_cn: “坐在我们两人当中吧，”帕迪说，挤了挤身子。

source: And so she climbed in, carrying her flip-flops in her hand.
zh_cn: 于是她把人字拖拿在手里爬进了车里。

source: On a whim, she had decided against shorts that morning; she was wearing a washed-out old dress in flowered cotton, with a Peter Pan collar.
zh_cn: 这天早上她突发异想不穿短裤，现在她穿着一条洗旧了的花棉布连衣裙，连衣裙上开着小圆领。

source: On their way back to Nigel's house, Jane was an accomplice in an episode of shoplifting- which fortunately went undetected, or at least unreported.
zh_cn: 在他们开车回到尼格尔家去的路上，简成了一桩商店偷窃案的同谋犯，还好事情没有被店家察觉，或者至少没有报警。

source: She had never stolen anything before; the possibility hadn't crossed her mind.
zh_cn: 简以前从来没有偷过任何东西，也没有想到过要去偷东西，但是她昏了头。

source: But she was disoriented: as they drove along, Paddy had pulled the elastic bands off her two bunches so that her hair blew crazily into all their faces.
zh_cn: 车开着的时候，帕迪把她头发上的两个橡皮圈扯了下来，于是她的头发披撒开来盖到了脸上。

source: Whipping across her vision, the strands of it were like a hallucination, distracting her from her larger bewilderment at half sitting on Paddy's knee, feeling Daniel ease his arm around her once, on a straight stretch when he wasn't changing gears.
zh_cn: 发丝在她眼前舞动拍打造成了一种幻觉，分散了她的注意力，她本该更加警觉，因为她正半坐在帕迪的膝盖上，并且丹尼尔伸开手臂揽在她腰上，当时车正走在一条直道上，丹尼尔无须换挡。

source: (Nigel's father had chosen a manual gearbox on the M.G.C.) "It's all right," Daniel had said. "Don't worry about us. We're not all bad."
zh_cn: （尼格尔的父亲买车时选了手动挡）“没事，”丹尼尔说，“不用担心，我们不全是坏人。”

source: "I like her," Paddy commented. "She doesn't talk too much."
zh_cn: “我喜欢她，”帕迪品头论足地说，“她话不多。”

source: The oddest thing was that she wasn't worrying, although she knew she ought to be; especially when they made plans to keep the shopkeeper talking while she, Jane, slipped bottles of whatever alcohol she could get into their canvas haversack.
zh_cn: 最不可思议的是简并不害怕，尽管她知道自己本该害怕的，尤其是当他们打算趁着店员在说话的时候，让简去偷一瓶随便什么酒塞进他们的帆布袋里。

source: "He keeps it in a little side room," Daniel said. "You don't look as if you drink, so no one will suspect you.
zh_cn: “酒放在边上的一个小房间里，”丹尼尔说，“你看上去不像喝酒的人，所以没有人会怀疑你。

source: If they do, you can cry and say that we kidnapped you and made you do it."
zh_cn: 假如他们发现你了，你可以哭着说是我们劫持了你，是我们强迫你这么做的。”

source: Jane didn't recognize the shop, though it was only a few miles from her home; her mother had most of their groceries delivered, and, anyway, Mrs. Allsop would never have shopped in such a dimly lit, cellar-smelling place, its windows hung with conflicting advertisements for cigarettes and tea, its shelves crowded promiscuously with faded tins, china souvenirs, regiments of sweet jars.
zh_cn: 简并不知道这家商店，尽管这家店离开她家只有几英里。她母亲购买的大多数日用品都是送货上门的，而且，艾尔索普太太从来不会到这样一个灯光暗淡，气味难闻的商店里买东西。商店的橱窗上挂着各种内容自相矛盾的香烟和茶叶广告，货架上乱七八糟地堆满了标贴褪色的罐头，中国制造的礼品，还有许多糖果瓶子。

source: A naked fat ham in orange bread crumbs jostled for space on the counter with packets of parsley sauce and marked-down broken biscuits.
zh_cn: 柜台上一条沾着面包屑的肥火腿赤条条地与许多包欧芹调味汁以及包装破损的饼干挤在一起。

source: Repulsion at the ham's sickly flesh smell fuelled Jane's impossible swift acts.
zh_cn: 火腿散发出油腻味使简感到恶心，也促使她的动作变得格外敏捷。

source: She chose the cool bottles by feel in the dark little off-license nook, beyond a curtain of plastic strips, because she could hardly see in there; her eyes were dazzled from the light outside.
zh_cn: 黑暗中她在酒类货架的角落里摸索着挑选冰冷的瓶子，这里与外间隔着一块用塑料条做成的门帘，她在这里看不清东西，她的眼睛被外面的光亮照花了。

source: Her heart thudded as violently as an engine stalling, but her hands were sure.
zh_cn: 她的心脏激烈跳动像是一架失速的引擎，但是她双手的动作却很坚定。

source: The boys paid for the sliced bread and tomatoes and tin of tuna they bought, thanking the shopkeeper loftily as they left.
zh_cn: 男孩们买了切片面包，西红柿和金枪鱼，他们付了钱，在离去时还居高临下地向店员道了谢。

source: Jane sat in the car again between them, her trophies chinking on her knee.
zh_cn: 简上车后仍坐在他们中间，她把战利品放在她的膝盖上。

source: "Isn't she good?"
zh_cn: “她不错吧？”

source: Paddy said when they'd driven on and he'd excavated in the haversack, finding dusty Mateus rose and Johnnie Walker and several bottles of barley wine.
zh_cn: 车开动后帕迪说，他把帆布包里的东西拿了出来，里面有一瓶沾满灰尘的马刁士蜜桃红葡萄酒，一瓶尊尼获加威士忌，还有几瓶大麦酒。

source: "She's a natural," Daniel said.
zh_cn: “她是天生的，”丹尼尔说。

source: "Now she belongs to us," Paddy said. "We've got the dirt on her."
zh_cn: “现在她属于我们，”帕迪说，“我们已经把她拉下水了。”

source: Jane sought in the recesses of her consciousness the remorse that she knew ought to be lying in wait- that poor honest shopkeeper, struggling to make a living!
zh_cn: 简在意识深处寻找着，她知道在那里应该存在着对店员的同情心——这个老实巴交的可怜人混口饭吃也不容易。

source: But it was as if all recesses had flattened out for the moment, into a balmy infinite present amid the sunshine and the gusts and swirls of wind as the M.G.C. swerved around bends.
zh_cn: 但是在这一刻一切恻隐之心似乎都被抚平了，眼前只有风和日丽的好时光——阳光明媚，汽车驶过弯道激起阵阵旋风。

source: Her consciousness was filled to the brim with her contact- astonishing because she was so virgin in contacts- with the boys' warm bodies, lapping against her; she didn't even much mind Nigel's chin resting showily on her shoulder, when he leaned over from his perch in the back.
zh_cn: 她的意识中充满了她与男孩身体的温暖接触——令人惊奇的是她是初次有这样的接触。坐在两个男孩中间，她甚至不在意尼格尔堂而皇之地把下巴搁在她的肩膀上，他的身子从后排朝前倚靠过来。

source: It had never occurred to her, until now, that the masculine- a suspect realm of deep-voiced otherness, beard growth, fact-authority, and bathroom smells- could be so intimately important, in relation to herself; it seemed as improbable as two planets colliding.
zh_cn: 直到今天为止她从来没有意识到，男人的阳刚之气竟对她如此重要——那些嗓音深沉的人们有着可疑的世界，他们长着胡子，讲究事实，并且身上有着卫生间的气味。这简直像两颗行星相撞一样不可思议。

source: Nigel had a bottle opener on his key ring, and they started on the barley wine, after a discussion with Jane over whether she drank alcohol or not.
zh_cn: 尼格尔的钥匙圈上有个开瓶器，在与简讨论了一下她是否喝酒后，他们开始试着打开一瓶大麦酒。

source: "I don't," she owned up candidly. "But I might start."
zh_cn: “我不会喝，”她老实承认，“不过我也许可以开始喝一点了。”

source: Daniel, solicitous, said that they mustn't give her too much, just a little sip at a time.
zh_cn: 丹尼尔献殷勤地说他们不会让她多喝，每次只尝一点点。

source: They watched her face to see whether she liked the taste and laughed delightedly when it was obvious that she didn't, although she bravely insisted ("I do! I do quite like it!"), as entertained as if they were feeding beer to a puppy.
zh_cn: 他们观察着她的脸部表情，看她是不是喜欢酒的味道。当他们看到她的神色明显表现出她不喜欢酒味，他们开心地大笑起来，尽管她勇敢地坚持着（“我喜欢，我真的很喜欢！”）。他们似乎在玩给一条小狗灌啤酒的游戏。
